Revit 2024 API
PointLocationOnCurve.MeasureFrom Property
 The location on the curve from which the measurement is taken.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public PointOnCurveMeasureFrom MeasureFrom { get; set; }
Visual Basic
Public Property MeasureFrom As PointOnCurveMeasureFrom
	Get
	Set
Visual C++
public:
property PointOnCurveMeasureFrom MeasureFrom {
	PointOnCurveMeasureFrom get ();
	void set (PointOnCurveMeasureFrom value);
}
Remarks
 The measure-from is not checked until this class is assigned for a particular reference point on a particular curve. At that time, the measure-from must be valid for the curve.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
PointLocationOnCurve Class
Autodesk.Revit.DB Namespace